app/controllers/api/event_splits_controller.rb

SELECT "event_splits".* FROM "event_splits" WHERE "event_splits"."event_id" = $1  [["event_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."user_id" IN ('1', '2')
---
  def index
    puts "eventSplitsController reached"
    puts "params"
    puts params
    puts params[:event_id]
    @event_splits = EventSplit.where(event_id: params[:event_id]).includes(:user)

SELECT "event_splits".* FROM "event_splits" WHERE "event_splits"."user_id" = $1  [["user_id", 1]]
---
  def show
    user_id = params[:id]

    @event_splits = EventSplit.where(user_id: user_id).includes(:event)

SELECT SUM("event_splits"."dollar_amt") FROM "event_splits" WHERE "event_splits"."user_id" = $1  [["user_id", 1]]
---
  def owed_amount_current_user
    user_id = params[:id]
    @owed_amount = EventSplit.where(user_id: user_id).sum(:dollar_amt)