app/controllers/api/events_controller.rb

  def index
    @events = Event.all.includes(:lender)
---
SELECT "events".* FROM "events"

  def lended_amount_current_user
    user_id = params[:id]
    lended_events = Event.where(lender_id: user_id)
    @lended_amount = lended_events.sum(:dollar_amt)

    # #includes for Active Record usually does two separate queries, until you add an aggregate function
    # like #sum to it, then it becomes a left outer join. Check Rails console to see 18 Dec 2015
    lended_events_joined = Event.where(lender_id: user_id).includes(:event_splits)

    # puts "events_sum:"
    # puts @lended_amount

    paid_back_amt = lended_events_joined.inject(0) do |accum, lended_event|
      event_splits = lended_event.event_splits

      sum = event_splits.where("user_id NOT IN (?)", user_id).sum(:dollar_amt)
---
SELECT "events".* FROM "events" WHERE "events"."lender_id" = $1  [["lender_id", 1]]
SELECT SUM("events"."dollar_amt") FROM "events" WHERE "events"."lender_id" = $1  [["lender_id", 1]]
SELECT "event_splits".* FROM "event_splits" WHERE "event_splits"."event_id" IN (1, 2)
SELECT SUM("event_splits"."dollar_amt") FROM "event_splits" WHERE "event_splits"."event_id" = $1 AND (user_id NOT IN ('1'))  [["event_id", 1]]

  def owed_amount
    user_id = params[:id]

    events_ordered = Event.order(:lender_id).all
    event_splits_ordered = EventSplit.order(:event_id).where(user_id: user_id).all
---
SELECT "events".* FROM "events"  ORDER BY "events"."lender_id" ASC
SELECT "event_splits".* FROM "event_splits" WHERE "event_splits"."user_id" = $1  ORDER BY "event_splits"."event_id" ASC  [["user_id", 1]]

  def lended_amount
    user_id = params[:id]

    event_ids_ordered = Event.order(:lender_id).where(lender_id: user_id).select(:id)
    event_splits_ordered = EventSplit.order(:event_id).where("event_id IN (?)", event_ids_ordered)
---
SELECT "event_splits".* FROM "event_splits" WHERE "event_splits"."event_id" IN (1, 2)