app/controllers/api/transactions_controller.rb

SELECT "transactions".* FROM "transactions"  ORDER BY "transactions"."created_at" DESC
---
  def index
    @transactions = Transaction.all.order(created_at: :desc).includes(:lender, :borrower)